pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxEvadc_reg.h
/** \brief 1720, Group 4 Result Register 8\n */
#define EVADC_G4_RES8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021720u)
/** Alias (User Manual Name) for EVADC_G4_RES8.
* To use register names with standard convension, please use EVADC_G4_RES8.
*/
#define EVADC_G4RES8 (EVADC_G4_RES8)

/** \brief 1724, Group 4 Result Register 9\n */
#define EVADC_G4_RES9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021724u)
/** Alias (User Manual Name) for EVADC_G4_RES9.
* To use register names with standard convension, please use EVADC_G4_RES9.
*/
#define EVADC_G4RES9 (EVADC_G4_RES9)

/** \brief 1728, Group 4 Result Register 10\n */
#define EVADC_G4_RES10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021728u)
/** Alias (User Manual Name) for EVADC_G4_RES10.
* To use register names with standard convension, please use EVADC_G4_RES10.
*/
#define EVADC_G4RES10 (EVADC_G4_RES10)

/** \brief 172C, Group 4 Result Register 11\n */
#define EVADC_G4_RES11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF002172Cu)
/** Alias (User Manual Name) for EVADC_G4_RES11.
* To use register names with standard convension, please use EVADC_G4_RES11.
*/
#define EVADC_G4RES11 (EVADC_G4_RES11)

/** \brief 1730, Group 4 Result Register 12\n */
#define EVADC_G4_RES12 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021730u)
/** Alias (User Manual Name) for EVADC_G4_RES12.
* To use register names with standard convension, please use EVADC_G4_RES12.
*/
#define EVADC_G4RES12 (EVADC_G4_RES12)

/** \brief 1734, Group 4 Result Register 13\n */
#define EVADC_G4_RES13 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021734u)
/** Alias (User Manual Name) for EVADC_G4_RES13.
* To use register names with standard convension, please use EVADC_G4_RES13.
*/
#define EVADC_G4RES13 (EVADC_G4_RES13)

/** \brief 1738, Group 4 Result Register 14\n */
#define EVADC_G4_RES14 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF0021738u)
/** Alias (User Manual Name) for EVADC_G4_RES14.
* To use register names with standard convension, please use EVADC_G4_RES14.
*/
#define EVADC_G4RES14 (EVADC_G4_RES14)

/** \brief 173C, Group 4 Result Register 15\n */
#define EVADC_G4_RES15 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RES*)0xF002173Cu)
/** Alias (User Manual Name) for EVADC_G4_RES15.
* To use register names with standard convension, please use EVADC_G4_RES15.
*/
#define EVADC_G4RES15 (EVADC_G4_RES15)

/** \brief 1780, Group 4 Result Reg. 0, Debug */
#define EVADC_G4_RESD0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021780u)
/** Alias (User Manual Name) for EVADC_G4_RESD0.
* To use register names with standard convension, please use EVADC_G4_RESD0.
*/
#define EVADC_G4RESD0 (EVADC_G4_RESD0)

/** \brief 1784, Group 4 Result Reg. 1, Debug */
#define EVADC_G4_RESD1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021784u)
/** Alias (User Manual Name) for EVADC_G4_RESD1.
* To use register names with standard convension, please use EVADC_G4_RESD1.
*/
#define EVADC_G4RESD1 (EVADC_G4_RESD1)

/** \brief 1788, Group 4 Result Reg. 2, Debug */
#define EVADC_G4_RESD2 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021788u)
/** Alias (User Manual Name) for EVADC_G4_RESD2.
* To use register names with standard convension, please use EVADC_G4_RESD2.
*/
#define EVADC_G4RESD2 (EVADC_G4_RESD2)

/** \brief 178C, Group 4 Result Reg. 3, Debug */
#define EVADC_G4_RESD3 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF002178Cu)
/** Alias (User Manual Name) for EVADC_G4_RESD3.
* To use register names with standard convension, please use EVADC_G4_RESD3.
*/
#define EVADC_G4RESD3 (EVADC_G4_RESD3)

/** \brief 1790, Group 4 Result Reg. 4, Debug */
#define EVADC_G4_RESD4 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021790u)
/** Alias (User Manual Name) for EVADC_G4_RESD4.
* To use register names with standard convension, please use EVADC_G4_RESD4.
*/
#define EVADC_G4RESD4 (EVADC_G4_RESD4)

/** \brief 1794, Group 4 Result Reg. 5, Debug */
#define EVADC_G4_RESD5 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021794u)
/** Alias (User Manual Name) for EVADC_G4_RESD5.
* To use register names with standard convension, please use EVADC_G4_RESD5.
*/
#define EVADC_G4RESD5 (EVADC_G4_RESD5)

/** \brief 1798, Group 4 Result Reg. 6, Debug */
#define EVADC_G4_RESD6 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF0021798u)
/** Alias (User Manual Name) for EVADC_G4_RESD6.
* To use register names with standard convension, please use EVADC_G4_RESD6.
*/
#define EVADC_G4RESD6 (EVADC_G4_RESD6)

/** \brief 179C, Group 4 Result Reg. 7, Debug */
#define EVADC_G4_RESD7 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF002179Cu)
/** Alias (User Manual Name) for EVADC_G4_RESD7.
* To use register names with standard convension, please use EVADC_G4_RESD7.
*/
#define EVADC_G4RESD7 (EVADC_G4_RESD7)

/** \brief 17A0, Group 4 Result Reg. 8, Debug */
#define EVADC_G4_RESD8 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF00217A0u)
/** Alias (User Manual Name) for EVADC_G4_RESD8.
* To use register names with standard convension, please use EVADC_G4_RESD8.
*/
#define EVADC_G4RESD8 (EVADC_G4_RESD8)

/** \brief 17A4, Group 4 Result Reg. 9, Debug */
#define EVADC_G4_RESD9 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF00217A4u)
/** Alias (User Manual Name) for EVADC_G4_RESD9.
* To use register names with standard convension, please use EVADC_G4_RESD9.
*/
#define EVADC_G4RESD9 (EVADC_G4_RESD9)

/** \brief 17A8, Group 4 Result Reg. 10, Debug */
#define EVADC_G4_RESD10 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF00217A8u)
/** Alias (User Manual Name) for EVADC_G4_RESD10.
* To use register names with standard convension, please use EVADC_G4_RESD10.
*/
#define EVADC_G4RESD10 (EVADC_G4_RESD10)

/** \brief 17AC, Group 4 Result Reg. 11, Debug */
#define EVADC_G4_RESD11 /*lint --e(923, 9078)*/ (*(volatile Ifx_EVADC_G_RESD*)0xF00217ACu)
/** Alias (User Manual Name) for EVADC_G4_RESD11.
* To use register names with standard convension, please use EVADC_G4_RESD11.
*/
#define EVADC_G4RESD11 (EVADC_G4_RESD11)

